Revit 2027 API
ForgeTypeId.Equals Method
 Determines whether this ForgeTypeId is equal to another.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override bool Equals(
	Object other
)
Public Overrides Function Equals (
	other As Object
) As Boolean
public:
virtual bool Equals(
	Object^ other
) override
abstract Equals :
        other : Object -> bool
override Equals :
        other : Object -> bool
Parameters
other Object
 The ForgeTypeId with which to compare this ForgeTypeId.
Return Value
Boolean
 True if the given ForgeTypeId is equal to this one, or false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
See Also
Reference
ForgeTypeId Class
Autodesk.Revit.DB Namespace